# Напиши програму, яка пише, який варіант відповіді був обраний.
# 1.Підготовка програми.
#  --Підключи необхідні віджети, створи програму та вікно. Зроби так, щоб вікно не закривалося відразу після запуску програми.
#  --Якщо не пам'ятаєш, як це робити, подивися у першому завданні.


# 2.Створи радіокнопки. - 3 штуки
# Для створення кнопки необхідно підключити віджет QRadioButton.


# 3.Встановіть радіокнопку, яка буде обрана на самому початку.
# Для цього використовуй команду: назва_кнопки.setChecked(True).

# 4.Створи групу радіокнопок.
# Це дозволить об'єднати всі радіокнопки, які повинні працювати разом.
# Для роботи з групами кнопок необхідно підключити QButtonGroup.

# 5.Додай радіокнопки до створеної групи.
# Для цього використовуй команду: назва_групи_радіокнопок.addButton(назва_радіокнопки, id = число). 
# Поле id — це унікальний номер кнопки, яким потім буде зручно до неї звертатися.



# 6.Створи вертикальну напрямну лінію та розмісти на ній кожну радіокнопку.
# Якщо не пам'ятаєш, як це робити, подивися на попередні завдання.



# 7.Створи кнопку «Перевірити» і прикріпи її на вертикальну напрямну.
# Якщо не пам'ятаєш, як це робити, подивися на попередні завдання.


# 8.Створи текстове поле (без тексту) та розмісти його на вертикальній напрямній.
# При запуску програми нам не потрібен жодний текст у даному полі, але надалі при натисканні на кнопку 
# текст цього віджету змінюватиметься на інформацію про кнопку.


# 9.Зроби кнопку активною.
# При натисканні на кнопку нам необхідно змінювати текст у віджеті з написом на потрібний нам.
# Зробити це можна за допомогою наступної команди:
#  назва_віджета_з_написом.setText("Вибрана кнопка під номером" + str(назва_групи_радіокнопок.checkedId())). 
#  Метод checkedId() поверне значення поля id тієї радіокнопки, яку вибрано в даний момент.

